/*
2018/4/13
题目67
三角形面积
时间限制：3000 ms  |  内存限制：65535 KB
难度：2
描述
给你三个点，表示一个三角形的三个顶点，现你的任务是求出该三角形的面积
输入
每行是一组测试数据，有6个整数x1,y1,x2,y2,x3,y3分别表示三个点的横纵坐标。（坐标值都在0到10000之间）
输入0 0 0 0 0 0表示输入结束
测试数据不超过10000组
输出
输出这三个点所代表的三角形的面积，结果精确到小数点后1位（即使是整数也要输出一位小数位）
样例输入
0 0 1 1 1 3
0 1 1 0 0 0
0 0 0 0 0 0
样例输出
1.0
0.5
*/

#include<iostream>
#include<math.h>
using namespace std;

int main() 
{
	double a, b, c, s;
	int x1, y1, x2, y2, x3, y3;
	while (cin >> x1 >> y1 >> x2 >> y2 >> x3 >> y3)
	{
		if (x1==0&&y1==0&&x2==0&&y2==0&&x3==0&&y3 == 0) break;
		a = sqrt((x1 - x2)*(x1 - x2) + (y1 - y2)*(y1 - y2));
		b = sqrt((x1 - x3)*(x1 - x3) + (y1 - y3)*(y1 - y3));
		c = sqrt((x2 - x3)*(x2 - x3) + (y2 - y3)*(y2 - y3));
		s = 1 / 4.0*sqrt(4 * b*b*c*c - (b*b + c*c - a*a)*(b*b + c*c - a*a));
		cout << s << endl;
	}
	system("pause");
}