/*
2018/3/13
题目74
小学生算术
时间限制：3000 ms  |  内存限制：65535 KB
难度：1
描述
很多小学生在学习加法时，发现“进位”特别容易出错。你的任务是计算两个三位数在相加时需要多少次进位。你编制的程序应当可以连续处理多组数据，直到读到两个0（这是输入结束标记）。
输入
输入两个正整数m,n.(m,n,都是三位数)
输出
输出m,n,相加时需要进位多少次。
样例输入
123 456
555 555
123 594
0 0
样例输出
0
3
1
*/

#include<iostream>
using namespace std;
int main()
{
	int m, n,a1,a2,a3,b1,b2,b3;
	while(1)
	{
		int i = 0,t ;
		scanf("%d %d", &m, &n);
		if (m < 100 || m>999 || n < 100 || n>999) break;
		a1 = m / 100;
		a2 = m % 100 / 10;
		a3 = m % 100 % 10;
		b1 = n / 100;
		b2 = n % 100 / 10;
		b3 = n % 100 % 10;
		if (a3 + b3 >= 10) {
			i++; t = 1 ;
		}
		else t = 0;
		if (a2 + b2 + t >= 10) {
			i++; t = 1;
		}
		else t = 0;
		if (a1 + b1 + t >= 10) {
			i++;
		}
		if (m == 0 && n == 0)break;
		cout << i << endl;
	}
	return 0;
	system("pause");
}